# EnterValueOrFormula Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..EnterValueOrFormula Property
BuiltInFailures..::..SiteFailures Class See Also
---
Enter a value or a formula starting with '='.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EnterValueOrFormula { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnterValueOrFormula As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EnterValueOrFormula {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace